Tekla.Structures.Dialog.Localization.Util
The Util class contains general localizers for different kinds of controls.

Tekla.Structures.Dialog.Localization.Util.LocalizeListControl(Tekla.Structures.Dialog.Localization,System.Object)
Localizes a List control.
localization: The localization instance to be used.
obj: The object to be localized.

Tekla.Structures.Dialog.Localization.Util.LocalizeDataGridView(Tekla.Structures.Dialog.Localization,System.Object)
Localizes a DataGridView.
localization: The localization instance to be used.
obj: The object to be localized.

Tekla.Structures.Dialog.Localization.Util.LocalizeToolStrip(Tekla.Structures.Dialog.Localization,System.Object)
Localizes a ToolStrip.
localization: The localization instance to be used.
obj: The object to be localized.

Tekla.Structures.Dialog.Localization.Util.LocalizeImageListComboBox(Tekla.Structures.Dialog.Localization,System.Object)
Localizes an ImageListComboBox.
localization: The localization instance to be used.
obj: The object to be localized.